# Data Cleaning and Preparation

### Handling Missing Data

In [9]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [7]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [8]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna() # Drops any row containig a missing value
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how="all") # This method will only drop rows that are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.673213 -1.776227 -0.174042
1  0.193342 -1.350103  0.650559
2  0.604623  0.026904 -0.831293
3 -2.478116 -0.298344 -0.104235
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

In [23]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.673213       NaN       NaN
1  0.193342       NaN       NaN
2  0.604623       NaN -0.831293
3 -2.478116       NaN -0.104235
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

In [25]:
df.dropna()

          0         1         2
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

In [26]:
df.dropna(thresh=2)

          0         1         2
2  0.604623       NaN -0.831293
3 -2.478116       NaN -0.104235
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

### Filling in Missing Data

In [27]:
df

          0         1         2
0  1.673213       NaN       NaN
1  0.193342       NaN       NaN
2  0.604623       NaN -0.831293
3 -2.478116       NaN -0.104235
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

In [28]:
df.fillna(0)

          0         1         2
0  1.673213  0.000000  0.000000
1  0.193342  0.000000  0.000000
2  0.604623  0.000000 -0.831293
3 -2.478116  0.000000 -0.104235
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

Calling **fillna** with a dict, you can use a different fill value for each column.

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.673213  0.500000  0.000000
1  0.193342  0.500000  0.000000
2  0.604623  0.500000 -0.831293
3 -2.478116  0.500000 -0.104235
4 -0.528647  0.909772  0.320620
5  1.217848  0.920776 -0.022492
6  0.345875 -0.565457  0.670349

In [31]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -1.642643 -0.856100  1.565154
1 -0.574800  0.352475  0.796398
2  0.166852 -1.482172  1.464631
3  1.202434 -0.062425  0.388152
4 -1.661175 -0.910605 -0.871186
5 -0.493293  0.479711  0.229188

In [32]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.642643 -0.856100  1.565154
1 -0.574800  0.352475  0.796398
2  0.166852       NaN  1.464631
3  1.202434       NaN  0.388152
4 -1.661175       NaN       NaN
5 -0.493293       NaN       NaN

In [33]:
df.fillna(method="ffill")

          0         1         2
0 -1.642643 -0.856100  1.565154
1 -0.574800  0.352475  0.796398
2  0.166852  0.352475  1.464631
3  1.202434  0.352475  0.388152
4 -1.661175  0.352475  0.388152
5 -0.493293  0.352475  0.388152

# Data Transformation

### Removing Duplicates

In [34]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate (has been observed in a previous row) or not.

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

**drop_duplicates** returns a DataFrame where the duplicated array is False

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

### Transforming Data Using a Function or Mapping

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [44]:
lowercased = data["food"].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

The **map** method on a Series accepts a function or dict-like object containing a mapping

In [46]:
data["animal"] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [48]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [52]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [53]:
transform = lambda x: x[:4].upper()

In [54]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

To create a transformed version of a dataset without modifying the original, a useful method is **rename**.

In [55]:
data.rename(index= str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### Discretization and Binning

In [57]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [59]:
bins = [18, 25, 35, 60, 100]

In [60]:
cats = pd.cut(ages, bins)

In [61]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [62]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [63]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [64]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [65]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [66]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [70]:
data = np.random.randn(20)
data

array([ 0.26164444,  0.52663919,  0.61240558,  0.85624819,  1.00088539,
       -1.53082867, -0.46113436,  1.1220104 , -2.29223781, -0.03017904,
        0.83591871, -0.50121058,  1.45330996,  1.25951348, -0.7617381 ,
        0.08258757, -0.2263929 ,  0.41865436, -2.17563529, -0.88442483])

The **precision=2** option limits the decimal precision to two digits

In [71]:
pd.cut(data, 4, precision=2)

[(-0.42, 0.52], (0.52, 1.45], (0.52, 1.45], (0.52, 1.45], (0.52, 1.45], ..., (-0.42, 0.52], (-0.42, 0.52], (-0.42, 0.52], (-2.3, -1.36], (-1.36, -0.42]]
Length: 20
Categories (4, interval[float64]): [(-2.3, -1.36] < (-1.36, -0.42] < (-0.42, 0.52] < (0.52, 1.45]]

### Detecting and Filtering Outliers

In [75]:
data = pd.DataFrame(np.random.randn(1000,4))

In [76]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022186    -0.001229    -0.043427     0.034383
std       1.007921     1.008868     0.980947     1.016336
min      -3.100387    -2.992672    -3.108521    -3.673066
25%      -0.715159    -0.700031    -0.765722    -0.638550
50%       0.005331    -0.003663    -0.009047     0.082949
75%       0.654305     0.654968     0.601651     0.724523
max       2.771183     3.335162     3.260687     3.125695

In [77]:
col = data[2]
col[np.abs(col) > 3]

188   -3.108521
232    3.260687
Name: 2, dtype: float64

In [79]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
66  -3.100387  0.157843 -0.459450 -0.798948
188  0.698645  1.048735 -3.108521  0.654745
232  0.068129 -0.654027  3.260687 -1.961292
357  0.100661 -1.131271 -0.554952  3.125695
503 -0.488781 -0.785305  0.579192 -3.673066
758  0.937302 -1.844645  2.170781  3.029199
833 -1.682321  3.335162  1.224133  0.453568
839 -1.273907  1.964473  1.514256  3.036296
855  1.082115  0.520959 -0.642078 -3.248062

In [80]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0  1.0

### Permutation and Random Sampling

In [81]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
sampler = np.random.permutation(5)

In [83]:
sampler

array([0, 4, 1, 3, 2])

In [84]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [85]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

To select a random subset without replacement, the **sample** method can be used

In [86]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

To generate a sample with replacement (to allow repeat choices), pass **replace=True** to sample.

In [87]:
choices = pd.Series([5, 7, -1, 6, 4])

In [88]:
draws = choices.sample(n=10, replace=True)
draws

4    4
4    4
3    6
4    4
2   -1
0    5
2   -1
1    7
1    7
3    6
dtype: int64

### Computing Indicator/Dummy Variables

In [89]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [90]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [91]:
mnames = ["movie_id", "title", "genres"]

In [93]:
movies = pd.read_table("../datasets/movielens/movies.dat", sep="::", header=None, names=mnames, engine="python")

In [94]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [97]:
all_genres = []

for x in movies.genres: all_genres.extend(x.split("|"))

In [99]:
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

* Start with a DataFrame of all zeros

In [100]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [101]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

* Now iterate trough each movie and set entries in each row of dummies to I. Use **dummies.columns** to compute the column indices 
    for each genre

In [102]:
gen = movies.genres[0]

In [103]:
gen.split("|")

['Animation', "Children's", 'Comedy']

In [104]:
dummies.columns.get_indexer(gen.split("|"))

array([0, 1, 2])

* Then **.iloc** can be used to set values based on these indices

In [112]:
for i, gen in enumerate(movies.genres):
   .....:     indices = dummies.columns.get_indexer(gen.split('|'))
   .....:     dummies.iloc[i, indices] = 1
   .....:

In [113]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [114]:
movies_windic.iloc[:]

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

# String Manipulation

### String Object Methods

In [116]:
val = "a,b,  guido"

In [117]:
val.split(",")

['a', 'b', '  guido']

**split** is often combined with **strip** to trim whitespace

In [119]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

Substrings can be concatenated together with a two colon delimiter using addition.

In [120]:
first, second, third = pieces

In [121]:
first + "::" + second + "::" + third

'a::b::guido'

In [122]:
"::".join(pieces)

'a::b::guido'

### Regular Expressions

In [123]:
import re

In [124]:
text = "foo    bar\t baz   \tqux"

In [125]:
text

'foo    bar\t baz   \tqux'

When **re.split("\s+", text)** is called, the regular expression is first compiled, and the its split method is called on the passed text

In [126]:
re.split("\s+", text)

['foo', 'bar', 'baz', 'qux']

In [130]:
text = "foo    bar\t baz   \tqux"

In [131]:
regex = re.compile('s\+')

In [132]:
regex.split(text)

['foo    bar\t baz   \tqux']

In [133]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [137]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [138]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [139]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

### Vectorized String Functions in pandas

In [141]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [143]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [144]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [145]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object